Revit 2027 API
ColorWithTransparency.SetTransparency Method
 set transparency
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTransparency(
	uint transparency
)
Public Sub SetTransparency (
	transparency As UInteger
)
public:
void SetTransparency(
	unsigned int transparency
)
member SetTransparency :
        transparency : uint32 -> unit
Parameters
transparency UInt32
 transparency
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The value is not valid. The valid range is 0 to 255.
See Also
Reference
ColorWithTransparency Class
Autodesk.Revit.DB Namespace